
/* Strings for login panel. See Keychain.cpp. */

"kLoginTitle" = "Digite o nome e palavra-passe para aceder ao conteúdo RSS.";
"kLoginInitialMessage"      = "Para aceder ao conteúdo RSS “%@”, necessita de aceder à área “%@” em %@. A palavra-passe será enviada sob a forma de texto legível.\n";
"kLoginFailedMessage"       = "O acesso falhou. Digite de novo o nome e palavra-passe para a área \"%@\" em %@.\n";
"kLoginUsernameField"       = "Nome:";
"kLoginPasswordField"       = "Palavra-passe:";
"kLoginLogInButton"         = "Aceder";
"kLoginCancelButton"        = "Cancelar";
"kLoginSavePasswordCheckbox"= "Guardar palavra-passe no porta-chaves";


/* Error Messages */

"PSInternalErrorDescription"        = "Ocorreu um erro interno na estrutura de subscrição de publicação.";
"PSInternalErrorFailureReason"      = "Ocorreu um erro interno na estrutura de subscrição de publicação.";
"PSInternalErrorRecoverySuggestion" = "Encerre a sessão e tente de novo.";

"PSPublishSettingsErrorDescription"        = "O conteúdo não foi publicado, porque as especificações de publicação são inválidas.";
"PSPublishSettingsErrorFailureReason"      = "As especificações de publicação são inválidas.";
"PSPublishSettingsErrorRecoverySuggestion" = "Verifique as especificações de publicação e tente de novo.";

"PSNotAFeedErrorDescription"        = "O conteúdo não foi carregado, porque o formato do conteúdo é desconhecido.";
"PSNotAFeedErrorFailureReason"      = "O formato do conteúdo é desconhecido.";
"PSNotAFeedErrorRecoverySuggestion" = "Verifique se a localização especificada contém um conteúdo no formato Atom ou RSS.";

"PSUnsupportedPermissionsErrorDescription"          = "Não foi possível publicar o conteúdo, porque o tipo de permissão não é suportado.";
"PSUnsupportedPermissionsErrorFailureReason"        = "O tipo de permissão não é suportado.";
"PSUnsupportedPermissionsErrorRecoverySuggestion"   = "Verifique o tipo de permissão e tente de novo.";

"PSUnsupportedIdentitiesErrorDescription"         = "Não foi possível publicar o conteúdo, porque o tipo de identidade não é suportado.";
"PSUnsupportedIdentitiesErrorFailureReason"       = "O tipo de identidade não é suportado.";
"PSUnsupportedIdentitiesErrorRecoverySuggestion"  = "Verifique o tipo de identidade e tente de novo.";

"NSURLErrorUserAuthenticationRequired Description" = "É necessário um nome de utilizador e uma palavra-passe";

/* Localized date/time formats. See DateClass.cpp */

"TodayFmt"      = "'Hoje', h:mm a";
"YesterdayFmt"  = "'Ontem', h:mm a";
"ThisWeekFmt"   = "EEEE, h:mm a";
"ThisYearFmt"   = "MMM d, h:mm a";
"PastYearFmt"   = "MMM d, ''yy, h:mm a";

/* Localizable file size formatters.  See StringClass::representationForBytes */

"0 bytes"            = "0 bytes";           /* String used for showing a zero byte size */
"1 byte"             = "1 byte";            /* String used for showing a one byte size */
"%.0f bytes"         = "%.0f bytes";        /* Format used to display a size between 2 and 100 bytes */
"%.1f KB (0.1)"      = "%.1f KB";           /* Format used to display sizes between 100 and 999 bytes */
"%.1f KB (1.0)"      = "%.1f KB";           /* Format used to display sizes between 1000 bytes and 9.9 KB */
"%.1f KB (10.0)"     = "%.1f KB";           /* Format used to display sizes between 10 and 99.9 KB */
"%.0f KB"            = "%.0f KB";           /* Format used to display sizes between 100 and 999 KB */
"%.1f MB (1.0)"      = "%.1f MB";           /* Format used to display sizes between 1000 KB and 9.9 MB */
"%.1f MB (10.0)"     = "%.1f MB";           /* Format used to display sizes between 10 and 99.9 MB */
"%.0f MB"            = "%.0f MB";           /* Format used to display sizes between 100 and 999 MB */
"%.1f GB (1.0)"      = "%.2f GB";           /* Format used to display sizes between 1000 MB and 9.9 GB */
"%.1f GB (10.0)"     = "%.2f GB";           /* Format used to display sizes between 10 and 99.9 GB */
"%.0f GB"            = "%.0f GB";           /* Format used to display sizes 100 GB or greater */

/* Localizable file names. Currently only used in EnclosureCore.cpp */

"kUntitledFileName" = "Sem nome";   /* If we download and enclosure for which we have no other name to go by */
